    |\^/|     Maple 13 (X86 64 LINUX)
._|\|   |/|_. Copyright (c) Maplesoft, a division of Waterloo Maple Inc. 2009
 \  MAPLE  /  All rights reserved. Maple is a trademark of
 <____ ____>  Waterloo Maple Inc.
      |       Type ? for help.
> restart:
> with(Statistics):
> assume(m11, real, m12, real, m13, real, m21, real, m22, real, m23, real);
> valnum := m11 = 1, m12 = -2, m13 = 1, m21 = 1, m22 = 1, m23 = -3;
     valnum := m11~ = 1, m12~ = -2, m13~ = 1, m21~ = 1, m22~ = 1, m23~ = -3

> p1 := PDF(RandomVariable(Normal(0, 1)), x1);
                                                  2
                                      1/2       x1
                                     2    exp(- ---)
                                                 2
                           p1 := 1/2 ---------------
                                            1/2
                                          Pi

> p2 := PDF(RandomVariable(Normal(0, 1)), x2);
                                                  2
                                      1/2       x2
                                     2    exp(- ---)
                                                 2
                           p2 := 1/2 ---------------
                                            1/2
                                          Pi

> p3 := PDF(RandomVariable(Normal(0, 1)), x3);
                                                  2
                                      1/2       x3
                                     2    exp(- ---)
                                                 2
                           p3 := 1/2 ---------------
                                            1/2
                                          Pi

> N := Matrix(3, 3, [m11, m12, m13, m21, m22, m23, 0, 0, 1]);
                               [m11~    m12~    m13~]
                               [                    ]
                          N := [m21~    m22~    m23~]
                               [                    ]
                               [ 0       0       1  ]

> with(LinearAlgebra):
> R := MatrixInverse(N);
                    [ m22~       m12~     m12~ m23~ - m13~ m22~ ]
                    [ ----     - ----     --------------------- ]
                    [  %1         %1               %1           ]
                    [                                           ]
               R := [  m21~     m11~       m11~ m23~ - m13~ m21~]
                    [- ----     ----     - ---------------------]
                    [   %1       %1                 %1          ]
                    [                                           ]
                    [  0         0                  1           ]

                          %1 := -m21~ m12~ + m11~ m22~

> x := R . Vector([z1, z2, z3]);
                 [ m22~ z1   m12~ z2   (m12~ m23~ - m13~ m22~) z3 ]
                 [ ------- - ------- + -------------------------- ]
                 [   %1        %1                  %1             ]
                 [                                                ]
            x := [  m21~ z1   m11~ z2   (m11~ m23~ - m13~ m21~) z3]
                 [- ------- + ------- - --------------------------]
                 [    %1        %1                  %1            ]
                 [                                                ]
                 [                       z3                       ]

                          %1 := -m21~ m12~ + m11~ m22~

> pdfZ := subs(x1 = x[1], p1) * subs(x2 = x[2], p2) * subs(x3 = x[3], p3) * abs(Determinant(R));
                       /m22~ z1   m12~ z2   (m12~ m23~ - m13~ m22~) z3\2
                       |------- - ------- + --------------------------|
             1/2       \  %1        %1                  %1            /
pdfZ := 1/4 2    exp(- -------------------------------------------------)
                                               2

          /  m21~ z1   m11~ z2   (m11~ m23~ - m13~ m21~) z3\2
          |- ------- + ------- - --------------------------|           2
          \    %1        %1                  %1            /         z3     /
    exp(- ---------------------------------------------------) exp(- ---)  /  (
                                   2                                  2   /

      3/2
    Pi    | %1 |)

%1 := -m21~ m12~ + m11~ m22~

> pdfY := int(pdfZ, z3 = -infinity..infinity);
        {
        {                2   2                           2   2
pdfY := { 1/2 exp(- (m11~  z2  - 2 m21~ z1 m11~ z2 + m22~  z1
        {
        {

                               2   2     2     2
     - 2 m22~ z1 m12~ z2 + m12~  z2  + z1  m23~  - 2 z1 m13~ z2 m23~

         2     2       2   2    /         2     2
     + z2  m13~  + m21~  z1 )  /  (2 (m12~  m23~  - 2 m12~ m23~ m13~ m22~
                              /

           2     2       2     2                               2     2
     + m13~  m22~  + m11~  m23~  - 2 m11~ m23~ m13~ m21~ + m13~  m21~

           2     2                               2     2         /
     + m21~  m12~  - 2 m21~ m12~ m11~ m22~ + m11~  m22~ ))) %1  /  (Pi | %1 |
                                                               /

                    2     2                               2     2       2     2
    signum(%1) (m12~  m23~  - 2 m12~ m23~ m13~ m22~ + m13~  m22~  + m11~  m23~

                                   2     2       2     2
     - 2 m11~ m23~ m13~ m21~ + m13~  m21~  + m21~  m12~

                                                             2     2
                                   2     2 1/2           m12~  m23~
     - 2 m21~ m12~ m11~ m22~ + m11~  m22~ )   ) , signum(-----------
                                                                2
                                                            2 %1

                                 2     2       2     2
       m12~ m23~ m13~ m22~   m13~  m22~    m11~  m23~    m11~ m23~ m13~ m21~
     - ------------------- + ----------- + ----------- - -------------------
                 2                  2             2                2
               %1               2 %1          2 %1               %1

           2     2
       m13~  m21~
     + ----------- + 1/2) = 1
              2
          2 %1

    infinity , otherwise

%1 := -m21~ m12~ + m11~ m22~

> simplify(subs(valnum, pdfY));
                            2                11    2             1/2
                exp(-3/50 z2  - 2/25 z1 z2 - --- z1 ) signum(3) 2
                                             100
           1/20 ----------------------------------------------------
                                         Pi

> 
# Gaussian case
> C := simplify(subs(valnum, N . Transpose(N)));
                                  [ 6    -4     1]
                                  [              ]
                             C := [-4    11    -3]
                                  [              ]
                                  [ 1    -3     1]

> Q := MatrixInverse(C);
                                [2/9    1/9     1/9 ]
                                [                   ]
                           Q := [1/9    5/9     14/9]
                                [                   ]
                                [1/9    14/9    50/9]

> z := Matrix(3, 1, [z1, z2, z3]);
                                        [z1]
                                        [  ]
                                   z := [z2]
                                        [  ]
                                        [z3]

> pdfZTh := 1/((2 * Pi)^(3/2) * sqrt(abs(Determinant(C)))) * exp(expand(-1/2*(Transpose(z) . Q . z)[1, 1]));
                1/2
pdfZTh := 1/12 2

               2                                  2                       2
    exp(-1/9 z1  - 1/9 z1 z2 - 1/9 z1 z3 - 5/18 z2  - 14/9 z2 z3 - 25/9 z3 )

       /   3/2
      /  Pi
     /

> 
# First marginal
> int(int(pdfZTh, z3=-infinity..infinity), z2=-infinity..infinity);
                                          2
                                        z1    1/2
                                  exp(- ---) 3
                                        12
                              1/6 ---------------
                                         1/2
                                       Pi

> int(int(subs(valnum, pdfZ), z3=-infinity..infinity), z2=-infinity..infinity);
                                          2
                                        z1    1/2
                                  exp(- ---) 3
                                        12
                              1/6 ---------------
                                         1/2
                                       Pi

# Second marginal
> int(int(pdfZTh, z3=-infinity..infinity), z1=-infinity..infinity);
                                        2
                                      z2    1/2   1/2
                                exp(- ---) 2    11
                                      22
                           1/22 ---------------------
                                          1/2
                                        Pi

> int(int(subs(valnum, pdfZ), z3=-infinity..infinity), z1=-infinity..infinity);
                                        2
                                      z2    1/2   1/2
                                exp(- ---) 2    11
                                      22
                           1/22 ---------------------
                                          1/2
                                        Pi

# Third marginal
> int(int(pdfZTh, z2=-infinity..infinity), z1=-infinity..infinity);
                                               2
                                   1/2       z3
                                  2    exp(- ---)
                                              2
                              1/2 ---------------
                                         1/2
                                       Pi

> int(int(subs(valnum, pdfZ), z2=-infinity..infinity), z1=-infinity..infinity);
                                               2
                                   1/2       z3
                                  2    exp(- ---)
                                              2
                              1/2 ---------------
                                         1/2
                                       Pi

# (1,2) marginal
> int(pdfZTh, z3=-infinity..infinity);
                                 2                11    2   1/2
                     exp(-3/50 z2  - 2/25 z1 z2 - --- z1 ) 2
                                                  100
                1/20 ------------------------------------------
                                         Pi

> int(subs(valnum, pdfZ), z3=-infinity..infinity);
                                 2                11    2   1/2
                     exp(-3/50 z2  - 2/25 z1 z2 - --- z1 ) 2
                                                  100
                1/20 ------------------------------------------
                                         Pi

# (2,3) marginal
> int(pdfZTh, z1=-infinity..infinity);
                                2                      2   1/2
                     exp(-1/4 z2  - 3/2 z2 z3 - 11/4 z3 ) 2
                 1/4 -----------------------------------------
                                        Pi

> int(subs(valnum, pdfZ), z1=-infinity..infinity);
                                2                      2   1/2
                     exp(-1/4 z2  - 3/2 z2 z3 - 11/4 z3 ) 2
                 1/4 -----------------------------------------
                                        Pi

# (1,3) marginal
> int(pdfZTh, z2=-infinity..infinity);
                                  2                     2   1/2
                      exp(-1/10 z1  + 1/5 z1 z3 - 3/5 z3 ) 5
                 1/10 -----------------------------------------
                                         Pi

> int(subs(valnum, pdfZ), z2=-infinity..infinity);
                                  2                     2   1/2
                      exp(-1/10 z1  + 1/5 z1 z3 - 3/5 z3 ) 5
                 1/10 -----------------------------------------
                                         Pi

> quit
memory used=54.2MB, alloc=47.6MB, time=0.45
